from fastapi import APIRouter
from app.schemas import OptionsResponse

router = APIRouter()

@router.get("/questionnaire_options")
async def get_options():
    return {
        "ethnography": [
            {
                "name": "Германские",
                "description": "моральный подтекст, наказание за глупость/жестокость, волшебство, говорящие животные."
            },
            {
                "name": "Славянские",
                "description": "богатырские мотивы, природа как персонаж, магические помощники."
            },
            {
                "name": "Кавказские",
                "description": "отвага, честь, хитрость, гостеприимство, борьба с судьбой и стихиями."
            },
            {
                "name": "Тюркские",
                "description": "восточный колорит, мудрость дервишей, юмор, важность слова."
            },
            {
                "name": "Французские",
                "description": "чудеса, волшебные превращения, феи, важные уроки для детей."
            },
            {
                "name": "Скандинавские",
                "description": "тролли, великаны, природа как персонаж, суровость мира, справедливость."
            },
            {
                "name": "Английские и Ирландские",
                "description": "феи, лесные духи, волшебные страны, нравственные дилеммы."
            },
            {
                "name": "Итальянские",
                "description": "рассудительность, наказание за ложь/жадность, чудеса."
            },
            {
                "name": "Испанские и Португальские",
                "description": "смесь арабского и европейского влияния, романтические и бытовые сказки."
            },
            {
                "name": "Греческие",
                "description": "мифологические и фольклорные сюжеты."
            },
            {
                "name": "Персидские",
                "description": "мудрость, судьба, справедливость, притчи."
            },
            {
                "name": "Индийские",
                "description": "карма, ответственность, перевоплощения, мудрые животные."
            },
            {
                "name": "Китайские",
                "description": "уважение к старшим, природные силы, ирония, мораль, основы дао и конфуцианства."
            },
            {
                "name": "Японские",
                "description": "волшебные духи, отношения с природой, честь, благодарность."
            },
            {
                "name": "Еврейские",
                "description": "мудрость, ирония, судьба и испытания, этический выбор, бытовая логика, юмор, этика, семейственность."
            },
        ],
        "genders": ["Мальчик", "Девочка", "Универсальный герой"],
        "interests": {
            "categories": [
                {"id": 1, "name": "Животные"},
                {"id": 2, "name": "Транспорт"},
                {"id": 3, "name": "Магия"},
                {"id": 4, "name": "Принцессы"},
                {"id": 5, "name": "Супергерои"},
                {"id": 6, "name": "Космонавты"},
                {"id": 7, "name": "Сказочные существа"},
                {"id": 8, "name": "Обычные дети/взрослые"},
                {"id": 9, "name": "Другое"}
            ],
            "subcategories": {
                "1": [
                    {"id": 101, "name": "Кошки"},
                    {"id": 102, "name": "Собаки"},
                    {"id": 103, "name": "Динозавры"},
                    {"id": 104, "name": "Лесные звери"}
                ],
                "2": [
                    {"id": 201, "name": "Машинки"},
                    {"id": 202, "name": "Поезда"},
                    {"id": 203, "name": "Самолеты"}
                ],
                "3": [
                    {"id": 301, "name": "Волшебницы"},
                    {"id": 302, "name": "Феи"},
                    {"id": 303, "name": "Самолеты"}
                ],
                "4": [
                    {"id": 401, "name": "Принцесса-бунтарка"},
                    {"id": 402, "name": "Принцесса-воительница"},
                    {"id": 403, "name": "Принцесса-изгнанница"}
                ],
                "5": [
                    {"id": 501, "name": "Железный человек"},
                    {"id": 502, "name": "Супермен"},
                    {"id": 503, "name": "Бэтмен"},
                    {"id": 504, "name": "Человек-паук"},
                    {"id": 505, "name": "Чудо-женщина"}
                ],
                "6": [
                    {"id": 601, "name": "Космонавты-испытатели"},
                    {"id": 602, "name": "Космонавты-исследователи"}
                ],
                "7": [
                    {"id": 701, "name": "Драконы"},
                    {"id": 702, "name": "Грифоны"},
                    {"id": 703, "name": "Пегас"},
                    {"id": 704, "name": "Феникс"}
                ],
                "8": [
                    {"id": 801, "name": "Ребенок"},
                    {"id": 802, "name": "Папа"},
                    {"id": 803, "name": "Мама"}
                ]
            }
        },
        "soft_skills": [
            "Самосохранение и безопасность", "Позитивность", "Эмпатия и сострадание",
            "Креативность", "Любознательность", "Смелость", "Управление стрессом",
            "Самомотивация", "Продуктивность", "Сверхусердие", "Справедливость", "Умение прощать",
            "Дружба", "Просоциальное поведение", "Лидерство", "Уверенность", "Убеждение",
            "Командный дух", "Гибкость", "Этикет"
        ],
        "languages": ["русском", "английском", "французском"]
    }